emacs-setup.org
#+TITLE: Emacs Configuration
#+OPTIONS: toc:2 h:4

* Overview

  I use a simple mechanism for breaking down a single emacs
  configuration across several component files. Any one of these
  component files is written in a format that enables that file to
  simultaneously be more than one thing. Each file surely contains
  elisp that is used to configure emacs, but that same file also
  contains a prose explanation behind the motivation and impact of the
  associated elisp. The same mechanism combines these component pieces
  to form an overall configuration, ultimately within a single file an
  in pure elisp, that emacs is capable of interpreting. In the end,
  the elisp from each file provides a discrete section of the total,
  generated configuration, just as the prose explanation from each
  file comes to represent a section within this document.

  The value of this mechanism draws from the belief that complexity is
  reduced when each file can bear a single responsibility for
  describing one smaller part of a large configuration. This follows
  from the similar expectation that any one chapter within a larger
  document can rightly be expected to describe a self-contained idea.

  The notion of first creating a prose explanation of how "code" works
  and then embedding that same code within that explanation is known
  as [[http://en.wikipedia.org/wiki/Literate_programming][Literate Programming]]. This document describes two such systems.
  The first, and larger of the two, is a literately programmed emacs
  configuration. The second is a description of how literate
  programming is achieved within emacs and then meaningfully used to
  configure emacs.

** Background: Literate Programming in Emacs

   Emacs provides support for literate programming most directly
   through [[http://orgmode.org/][org-mode]], and, within org-mode, [[http://orgmode.org/worg/org-contrib/babel/][babel]]. When practicing
   literate programming in this style, you author org-mode documents
   as normal and you additionally embed source code within these
   documents. Org-mode gives you strong support for authoring a
   document of any type: you can export to various formats, structure
   documents with semantic headings, generate a table of contents,
   enjoy hyperlink syntax, and more. In addition to basic org-mode
   functionality, babel then allows you to include source code within
   these documents. Source code in this context enjoys the same
   support that emacs provides for normal editing. You can choose any
   single language or a mix of languages and you work in the mode of
   the language.

   Embedded source code and its easy extraction is the foundation that
   enables literate programming. Briefly, as you consider programming
   "a thing," you are given all of the tools you need to write a
   stand-alone document about that "thing." You are free to layout and
   follow a narrative that you see fit. This document is my prose
   explanation of my emacs configuration.

** An Emacs Configuration

   [[http://www.gnu.org/software/emacs/manual/html_node/emacs/Init-File.html][When Emacs is started, it normally tries to load a Lisp program
   from an initialization file, or init file for short.]] The mechanism
   I use for managing my configuration is centered around two elisp
   files. A smaller initialization file, =init.el=, lives in
   =~/.emacs.d=, a location that is well known to emacs and this file
   is read on start-up. =init.el= presumes that it will be able to
   load a much larger elisp file located at
   =~/emacs.d/emacs-setup/emacs-setup.el=.

   These two files, =init.el= and =emacs-setup.el=, are extracted from
   source code blocks within .org files using babel. Appendix A
   contains =init.el= in its entirety. The contents of =emac-setup.el=
   are spread across the remainder of the .org files and can be
   constructed by concatenating the extract results of all files.

   In summary, I use Org-mode and .org files to serve two purposes:

    + .org files contain documentation of my configuration. This
      documentation can be viewed on Github or translated into another
      format such as LaTeX or HTML.

    + .org files contain embedded elisp behind the same configuration.
      Babel, a feature of Org-mode, can parse a .org file and extract
      the associated elisp.

   Appendix A details how I install and setup emacs. It also contains
   information about how =init.el= and the start up process works.
   Appendix B defines a process that is capable of creating
   =emacs-setup.el= from distinct .org files.

   When it comes to elisp, functions and variables associated with my
   emacs setup will begin with =jedcn-es=. The first variable we
   define sets the expecation that the directory =emacs-setup/= can be
   placed (or linked to) underneath =~/.emacs.d=:

#+begin_src emacs-lisp
  (setq jedcn-es/dir (concat
                      user-emacs-directory
                      "emacs-setup"))
#+end_src
* General

** Package Repository

   Extensions for emacs are known as "packages," and emacs has a built
   in package management system. Emacs lisp packages are stored in
   archives (elpas) and, initially, emacs knows about a single such
   archive: http://elpa.gnu.org. This archive has approximately 50
   packages.  However, there are additional elpas out there, and I
   have had good luck finding up-to-date packages in
   http://melpa.milkbox.net/.

   That said, each time I open up emacs I make sure that the package
   management system is initialized before I configure it to use
   melpa:

#+begin_src emacs-lisp
  (package-initialize)

  (add-to-list 'package-archives
               '("melpa" . "http://melpa.milkbox.net/packages/") t)
#+end_src

   My observation is that packages cannot be installed until a
   repository is contacted, at least once, and an overview of the
   contents are downloaded and cached locally.

   The following elisp will run =package-list-packages= if
   =~/.emacs.d/elpa= does not exist, and is rooted in the belief that
   the first time you run =package-list-packages= the contents of the
   archive are cached within =~/.emacs.d/elpa=.

#+begin_src emacs-lisp
  (unless
      (file-directory-p "~/.emacs.d/elpa")
    (package-list-packages))
#+end_src

   I am interested in ensuring that the elpa cache has been created so
   that I can programatically install packages. I first read about
   this in Sacha Chua's excellent blog post on her configuration:
   [[http://sachachua.com/blog/2012/06/literate-programming-emacs-configuration-file/][Literate programming and my Emacs configuration file]]. She defines a
   function (copied below) that will install the package if it is not
   present:

#+begin_src emacs-lisp
  (defun sacha/package-install (package &optional repository)
    "Install PACKAGE if it has not yet been installed.
  If REPOSITORY is specified, use that."
    (unless (package-installed-p package)
      (let ((package-archives (if repository
                                  (list (assoc repository package-archives))
                                package-archives)))
      (package-install package))))
#+end_src

   In combination, these facilities are the foundation of my package
   management strategy: initialize the subsystem, configure the
   repositories, and then define a means to programatically install
   missing packages. Doing this early on in my initialization process
   means that code which follows can state, "I expect to have package
   XYZ," by saying, =(sacha/package-install "XYZ")= and then presume
   that XYZ is present.

** PATH

   Emacs can run shell commands on your behalf. When it does this, it
   needs to know about the equivalent of your PATH so it can find
   commands.

   I am not sure how this works. There is something that is an
   environment variabled named =PATH= that is reachable via =(getenv
   "PATH")= and there is something else that is a elisp variable named
   =exec-path=.

   Rather than interact with my shell and have Emacs learn values from
   a =$PATH= proper, I am explicit about setting both:

#+begin_src emacs-lisp
  (setq jedcn-env-path "/usr/bin:/bin:/usr/sbin:/sbin:/usr/local/bin:/usr/texbin:/usr/local/share/npm/bin")

  (defun jedcn-sync-env-path-and-exec-path (desired-path)
    "Sets exec-path and env 'PATH' based on DESIRED-PATH"
    (setenv "PATH" desired-path)
    (setq exec-path (split-string desired-path ":")))

  (jedcn-sync-env-path-and-exec-path jedcn-env-path)
#+end_src
** Shell

   The following gives us a "login" shell. Without being quite sure
   what that means, I know that when this is in place my shell init
   files are run, my prompt looks normal, etc.

#+BEGIN_SRC emacs-lisp
  (setq explicit-bash-args '("--noediting" "--login"))
#+END_SRC

** UTF-8

  I picked this up from Magnars in his [[https://github.com/magnars/.emacs.d/blob/master/sane-defaults.el][sane-defaults.el]].

#+begin_src emacs-lisp
    (setq locale-coding-system 'utf-8)
    (set-terminal-coding-system 'utf-8)
    (set-keyboard-coding-system 'utf-8)
    (set-selection-coding-system 'utf-8)
    (prefer-coding-system 'utf-8)
    (set-language-environment 'utf-8)
    (set-default-coding-systems 'utf-8)
#+end_src

** Start Server

   Emacs is often run for hours (or days, or weeks) at a time. One of
   the benefits of such a long-lived process is that you can build a
   small tool, like =emacsclient= that can connect to a running emacs
   and request that something be edited. For example, you can tell git
   that it should use =emacsclient= whenever it needs to edit
   something:

#+begin_src sh :tangle no
  git config --global core.editor /usr/local/bin/emacsclient
#+end_src

   That said, here's the elisp that starts up an emacs server if it
   is needed:

#+begin_src emacs-lisp
  (require 'server)
  (if (server-running-p)
      (message "Server is running")
    (progn
      (message "Starting server")
      (server-start)))
#+end_src

** Save Place

  I got this one from Magnars: [[http://whattheemacsd.com/init.el-03.html][init.el-03]].

#+begin_src emacs-lisp
  (require 'saveplace)
  (setq-default save-place t)
  (setq save-place-file (expand-file-name ".places" user-emacs-directory))
#+end_src
** Appearance

*** Color Theme

#+begin_src emacs-lisp
  (sacha/package-install 'zenburn-theme)
  (sacha/package-install 'base16-theme)
  (load-theme 'zenburn t)
#+end_src

*** Font

    I like a bigger font (say, 18) and I vary between "Monaco-18" or
    "Menlo-18".

#+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "Menlo-18")
#+end_src

*** Mode Line

#+BEGIN_SRC emacs-lisp
  (sacha/package-install 'powerline)
  (require 'powerline)
  (powerline-center-theme)
#+END_SRC

** Memory

   I believe that Emacs will initiate Garbage Collection every time
   the =gc-cons-threshold= is allocated. That's less than 1MB. I've
   got 16GB, so I'm flush with memory if it speeds up my Emacs.

   This comes from Lewang's [[https://github.com/lewang/flx][documentation on flx]].

#+BEGIN_SRC emacs-lisp
  (setq gc-cons-threshold 20000000)
#+END_SRC
* Personal Information

#+begin_src emacs-lisp
  (setq user-full-name "Jed Northridge"
        user-mail-address "northridge@gmail.com")
#+end_src
* Key Bindings

  My main inspiration for keybindings have come from [[https://github.com/technomancy/emacs-starter-kit/blob/v2/modules/starter-kit-bindings.el][ESK]] and from
  [[https://github.com/magnars/.emacs.d/blob/master/key-bindings.el][Magnars]].

  If a particular mode has a global keybinding, then they keybinding
  will be with the mode in modes.org.

** See Occurrences while Searching

   If you are searching for something, and you press =C-o=, you can
   see all of the occurrences of that something within the file. Once
   that *Occur* window comes up, you can press =e= to start
   editing. You can press =C-c C-c= to get out of it.

#+begin_src emacs-lisp
  (define-key isearch-mode-map (kbd "C-o")
    (lambda () (interactive)
      (let ((case-fold-search isearch-case-fold-search))
        (occur (if isearch-regexp isearch-string (regexp-quote isearch-string))))))
#+end_src

** Running Methods

   When it comes to running methods explicitly, I always use C-x C-m.
   I picked this up from Steve Yegge's [[https://sites.google.com/site/steveyegge2/effective-emacs][Effective Emacs]]. He says use
   =execute-extended-command=, but I always use smex.

#+begin_src emacs-lisp
  (global-set-key "\C-x\C-m" 'smex)
#+end_src

** Text Size

   Making text larger or smaller with ease is something I use every
   day, several times a day. This happens most commonly when I am
   showing someone something in emacs (say, pairing or running a
   meeting), but also when I am at home and do not have my glasses.
   These particular keybindings are all about the =+= and the =-=.

#+begin_src emacs-lisp
  (define-key global-map (kbd "C-+") 'text-scale-increase)
  (define-key global-map (kbd "C--") 'text-scale-decrease)
#+end_src

