emacs-setup.org
*** rvm

#+begin_src emacs-lisp
  (sacha/package-install 'rvm)
#+end_src

    For emacs, on a MacOS, I believe the following configures my setup
    so that I'll use the default ruby provided by RVM when I need
    ruby.

#+begin_src emacs-lisp
  (rvm-use-default)
#+end_src

    I was reading a [[http://devblog.avdi.org/2011/10/11/rvm-el-and-inf-ruby-emacs-reboot-14/][blog post by Avdi Grimm about how he was using RVM]]
    the other day, and that's where I picked up the following helpful
    snippet that works with the emacs rvm subsystem to activate the
    correct version of ruby each time you open a ruby-based file:

#+begin_src emacs-lisp
  (add-hook 'ruby-mode-hook
            (lambda () (rvm-activate-corresponding-ruby)))
#+end_src

*** expand-region

    The functionality from =expand-region= is most easily described by
    watching the excellent emacsrocks.com [[http://emacsrocks.com/e09.html][Introductory Video]]. The
    project is hosted on [[https://github.com/magnars/expand-region.el][github]], and I use a standard setup for it,
    which means that you get things started by pressing =C-==.

#+begin_src emacs-lisp
  (sacha/package-install 'expand-region)
  (require 'expand-region)
  (global-set-key (kbd "C-=") 'er/expand-region)
#+end_src

** Project Management

   I use a combination of project-persist and projectile for project
   management in emacs. Persist lets me manage a "list of projects,"
   and I can generate this list from the layout of my file system.

   Once I've got that, Persist lets me open and close projects, and
   Projectile gives me a helpful "find file in project."

*** projectile

#+BEGIN_SRC emacs-lisp
  (sacha/package-install 'projectile)
  (require 'projectile)
#+END_SRC

*** project-persist

    [[https://github.com/rdallasgray/project-persist][project-persist]] is a lightweight means for keeping track of
    projects. Projects have names and a location on your file
    system. Optionally, they can have settings associated with them.

    That said, you can use project-persist to find a project and close
    a project, and project-persist provides hooks into these events.

**** Basic Installation

#+BEGIN_SRC emacs-lisp
  (sacha/package-install 'project-persist)
  (project-persist-mode t)
#+END_SRC

**** File System Integration

     I layout code on my computer in the following manner:

     + ~/c/misc :: Miscellaneous projects live here.
     + ~/c/personal :: Personal projects live here.
     + ~/d :: Code that I don't author, but that I look at
              semi-regularly lives here.

     For example, if I checkout the source for rake on my computer and I
     just scan through it, it lives at =~/d/rake/=. If I am actively
     working on a project named reveal-ck, it lives at
     =~/c/personal/reveal-ck/=.

     I capture these locations in =jedcn/pp-project-roots=.

     The following code scans through these directories and builds
     project-persist entries for each directory that is found. The
     main interactive entry point is =jedcn-pp/rebuild-projects=.

#+BEGIN_SRC emacs-lisp

  (require 'project-persist)

  (setq jedcn/pp-project-roots
        (list (concat (getenv "HOME") "/c/galileo")
              (concat (getenv "HOME") "/c/misc")
              (concat (getenv "HOME") "/c/personal")
              (concat (getenv "HOME") "/d")))

  (defun jedcn/pp-create-projects-under-root (root)
    "Create project-persist projects for directories under root"
    (let* ((dirs (directory-files root))
           (dir (car dirs))
           (ignore-dirs '("." ".." ".DS_Store")))
      (while dirs
        (unless (member dir ignore-dirs)
          (unless (pp/project-exists dir)
            (pp/project-setup (concat root "/" dir "/") dir)))
        (setq dirs (cdr dirs))
        (setq dir (car dirs)))))

  (defun jedcn/pp-create-all-projects (project-roots)
    "Create all project-persist projects based on PROJECT-ROOTS"
    (let* ((project-root (car project-roots)))
      (while project-roots
        (jedcn/pp-create-projects-under-root project-root)
        (setq project-roots (cdr project-roots))
        (setq project-root (car project-roots)))))

  (defun jedcn-pp/rebuild-projects ()
    (interactive)
    (jedcn/pp-create-all-projects jedcn/pp-project-roots))

  (jedcn-pp/rebuild-projects)
#+END_SRC

**** Hooks

     project-persist is intentionally minimal, so, to get something
     out of it you need to register hooks into its main events. These
     revolve around project management.

     It can integrate with projectile via a shared global variable
     named =default-directory=. If project-persist sets this
     variable, then projectile will pick up on it and focus searches
     underneath it.

**** Key Bindings

#+BEGIN_SRC emacs-lisp
  (global-set-key "\M-1"
                  'project-persist-find)

  (global-set-key "\M-2"
                  'projectile-find-file)

  (add-hook 'magit-mode-hook
            (lambda ()
              (define-key magit-mode-map "\M-1"
                'project-persist-find)
              (define-key magit-mode-map "\M-2"
                'projectile-find-file)
              (define-key magit-mode-map "\M-s"
                'sr-speedbar-toggle)))

  (global-set-key (kbd "C->")
                  'increase-window-height)

  (global-set-key (kbd "C-<")
                  'decrease-window-height)

  (global-set-key (kbd "C-,")
                  'decrease-window-width)

  (global-set-key (kbd "C-.")
                  'increase-window-width)

  (global-set-key (kbd "C-c s")
                  'sr-speedbar-select-window)
#+END_SRC
*** graphene

    Graphene is a great package, but there are parts of it I'm not yet
    ready for just yet (autocomplete, smartparens). Consequently, I've
    inlined copies of it here.

**** graphene-helper-functions.el

#+BEGIN_SRC emacs-lisp
  (defun kill-default-buffer ()
    "Kill the currently active buffer -- set to C-x k so that users are not asked which buffer they want to kill."
    (interactive)
    (let (kill-buffer-query-functions) (kill-buffer)))

  (defun kill-buffer-if-file (buf)
    "Kill a buffer only if it is file-based."
    (when (buffer-file-name buf)
      (when (buffer-modified-p buf)
          (when (y-or-n-p (format "Buffer %s is modified - save it?" (buffer-name buf)))
              (save-some-buffers nil buf)))
      (set-buffer-modified-p nil)
      (kill-buffer buf)))

  (defun kill-all-buffers ()
      "Kill all file-based buffers."
      (interactive)
      (mapc (lambda (buf) (kill-buffer-if-file buf))
       (buffer-list)))

  (defun kill-buffer-and-window ()
    "Close the current window and kill the buffer it's visiting."
    (interactive)
    (progn
      (kill-buffer)
      (delete-window)))

  (defun create-new-buffer ()
    "Create a new buffer named *new*[num]."
    (interactive)
    (switch-to-buffer (generate-new-buffer-name "*new*")))

  (defun insert-semicolon-at-end-of-line ()
    "Add a closing semicolon from anywhere in the line."
    (interactive)
    (save-excursion
      (end-of-line)
      (insert ";")))

  (defun comment-current-line-dwim ()
    "Comment or uncomment the current line."
    (interactive)
    (save-excursion
      (push-mark (beginning-of-line) t t)
      (end-of-line)
      (comment-dwim nil)))

  (defun newline-anywhere ()
    "Add a newline from anywhere in the line."
    (interactive)
    (end-of-line)
    (newline-and-indent))

  (defun increase-window-height (&optional arg)
    "Make the window taller by one line. Useful when bound to a repeatable key combination."
    (interactive "p")
    (enlarge-window arg))

  (defun decrease-window-height (&optional arg)
    "Make the window shorter by one line. Useful when bound to a repeatable key combination."
    (interactive "p")
    (enlarge-window (- 0 arg)))

  (defun decrease-window-width (&optional arg)
    "Make the window narrower by one line. Useful when bound to a repeatable key combination."
    (interactive "p")
    (enlarge-window (- 0 arg) t))

  (defun increase-window-width (&optional arg)
    "Make the window shorter by one line. Useful when bound to a repeatable key combination."
    (interactive "p")
    (enlarge-window arg t))

  ;; Create a new instance of emacs
  (when window-system
    (defun new-emacs-instance ()
      (interactive)
      (let ((path-to-emacs
             (locate-file invocation-name
                          (list invocation-directory) exec-suffixes)))
        (call-process path-to-emacs nil 0 nil))))
#+END_SRC

**** graphene-speedbar.el

     Some setup is necessary to use graphene-speedbar.el. I make sure
     I've got sr-speedbar installed and I define
     =graphene-speedbar-refresh-hooks= (which is normally defined in
     graphene.el).

#+BEGIN_SRC emacs-lisp
  (sacha/package-install 'sr-speedbar)
  (require 'sr-speedbar)

  (defvar graphene-speedbar-refresh-hooks '(after-save-hook)
    "List of hooks which on being run will cause speedbar to refresh.")

  (global-set-key (kbd "M-s") 'sr-speedbar-toggle)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (setq speedbar-hide-button-brackets-flag t
        speedbar-show-unknown-files t
        speedbar-smart-directory-expand-flag t
        speedbar-directory-button-trim-method 'trim
        speedbar-use-images nil
        speedbar-indentation-width 2
        speedbar-use-imenu-flag t
        sr-speedbar-width 20
        sr-speedbar-width-x 24
        sr-speedbar-auto-refresh nil
        sr-speedbar-skip-other-window-p t
        sr-speedbar-right-side nil)

  ;; Refresh the speedbar when relevant hooks are run.
  (defvar graphene-speedbar-refresh-hooks)
  (defvar graphene-speedbar-refresh-hooks-added nil
    "Whether hooks have been added to refresh speedbar.")

  (add-hook 'speedbar-mode-hook
            (when (not graphene-speedbar-refresh-hooks-added)
              (lambda ()
                (mapc (lambda (hook)
                        (add-hook hook 'speedbar-refresh))
                      graphene-speedbar-refresh-hooks)
                (setq graphene-speedbar-refresh-hooks-added t))))

  ;; More familiar keymap settings.
  (add-hook 'speedbar-reconfigure-keymaps-hook
            '(lambda ()
               (define-key speedbar-mode-map [S-up] 'speedbar-up-directory)
               (define-key speedbar-mode-map [right] 'speedbar-flush-expand-line)
               (define-key speedbar-mode-map [left] 'speedbar-contract-line)))

  ;; Highlight the current line
  (add-hook 'speedbar-mode-hook '(lambda () (hl-line-mode 1)))

  ;; Pin and unpin the speedbar
  (defvar graphene-speedbar-pinned-directory)

  (defadvice speedbar-update-directory-contents
    (around graphene-speedbar-pin-directory activate disable)
    "Pin the speedbar to the directory set in graphene-speedbar-pinned-directory."
    (let ((default-directory graphene-speedbar-pinned-directory))
      ad-do-it))

  (defadvice speedbar-dir-follow
    (around graphene-speedbar-prevent-follow activate disable)
    "Prevent speedbar changing directory on button clicks."
    (speedbar-toggle-line-expansion))

  (defadvice speedbar-directory-buttons-follow
    (around graphene-speedbar-prevent-root-follow activate disable)
    "Prevent speedbar changing root directory on button clicks.")

   (defvar graphene-speedbar-pin-advice
     '((speedbar-update-directory-contents around graphene-speedbar-pin-directory)
       (speedbar-dir-follow around graphene-speedbar-prevent-follow)
       (speedbar-directory-buttons-follow around graphene-speedbar-prevent-root-follow))
     "Advice to be enabled and disabled on graphene-[un]-pin-speedbar.")

  (defun graphene-speedbar-pin-advice-activate ()
    "Activate the advice applied to speedbar functions in order to pin it to a directory."
    (mapc 'ad-activate (mapcar 'car graphene-speedbar-pin-advice)))

  (defun graphene-pin-speedbar (directory)
    "Prevent the speedbar from changing the displayed root directory."
    (setq graphene-speedbar-pinned-directory directory)
    (mapc (lambda (ls) (apply 'ad-enable-advice ls)) graphene-speedbar-pin-advice)
    (graphene-speedbar-pin-advice-activate))

  (defun graphene-unpin-speedbar ()
    "Allow the speedbar to change the displayed root directory."
    (mapc (lambda (ls) (apply 'ad-disable-advice ls)) graphene-speedbar-pin-advice)
    (graphene-speedbar-pin-advice-activate))

  ;; Always use the last selected window for loading files from speedbar.
  (defvar last-selected-window
    (if (not (eq (selected-window) sr-speedbar-window))
        (selected-window)
      (other-window 1)))

  (defadvice select-window (after remember-selected-window activate)
    "Remember the last selected window."
    (unless (or (eq (selected-window) sr-speedbar-window) (not (window-live-p (selected-window))))
      (setq last-selected-window (selected-window))))

  (defun sr-speedbar-before-visiting-file-hook ()
    "Function that hooks `speedbar-before-visiting-file-hook'."
    (select-window last-selected-window))

  (defun sr-speedbar-before-visiting-tag-hook ()
    "Function that hooks `speedbar-before-visiting-tag-hook'."
    (select-window last-selected-window))

  (defun sr-speedbar-visiting-file-hook ()
    "Function that hooks `speedbar-visiting-file-hook'."
    (select-window last-selected-window))

  (defun sr-speedbar-visiting-tag-hook ()
    "Function that hooks `speedbar-visiting-tag-hook'."
    (select-window last-selected-window))
#+END_SRC

