emacs-setup.org
**** graphene-projects.el

     Some setup is necessary to use graphene-projects.el. I've
     previously required in project-persist, and then I define
     =graphene-speedbar-auto= and =graphene-project-pin-speedbar=
     (which are normally defined in graphene.el).

#+BEGIN_SRC emacs-lisp
  (defvar graphene-speedbar-auto t
    "Whether graphene should open sr-speedbar when a project is loaded.")

  (defvar graphene-project-pin-speedbar t
    "Pin the speedbar directory when opening a project.")
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun graphene-set-project-root (dir)
    "Change the default directory and update speedbar if used."
    (setq default-directory dir)
    (when graphene-speedbar-auto
      (sr-speedbar-open)
      (speedbar-update-contents)
      (when graphene-project-pin-speedbar
        (graphene-pin-speedbar dir))))

  (defun graphene-load-project-desktop ()
    "Load the project's desktop if available."
    (ignore-errors
      (setq default-directory project-persist-current-project-settings-dir)
      (message (format "Loading project desktop from %s" default-directory))
      (desktop-read project-persist-current-project-settings-dir)))

   ;; Kill all file-based buffers and unpin the speedbar before opening a project.
  (add-hook 'project-persist-before-load-hook
            (lambda ()
              (graphene-unpin-speedbar)
              (kill-all-buffers)))

   ;; Kill all file-based buffers and unpin the speedbar after closing a project.
  (add-hook 'project-persist-after-close-hook
            (lambda ()
              (kill-all-buffers)
              (graphene-unpin-speedbar)))

  ;; Set the project root directory, load the project desktop and update speedbar.
  (add-hook 'project-persist-after-load-hook
            (lambda ()
              (graphene-load-project-desktop)
              (graphene-set-project-root project-persist-current-project-root-dir)))

  ;; Save the project desktop.
  (add-hook 'project-persist-after-save-hook
            (lambda ()
              (message (format "Saving project desktop in %s" project-persist-current-project-settings-dir))
              (desktop-save project-persist-current-project-settings-dir)))

  ;; http://www.emacswiki.org/DeskTop#toc4: Overriding stale desktop locks
  ;;; desktop-override-stale-locks.el begins here
  (defun emacs-process-p (pid)
    "If pid is the process ID of an emacs process, return t, else nil.
  Also returns nil if pid is nil."
    (when pid
      (let ((attributes (process-attributes pid)) (cmd))
        (dolist (attr attributes)
          (if (string= "comm" (car attr))
              (setq cmd (cdr attr))))
        (if (and cmd (or (string= "emacs" cmd) (string= "emacs.exe" cmd))) t))))

  (defadvice desktop-owner (after pry-from-cold-dead-hands activate)
    "Don't allow dead emacsen to own the desktop file."
    (when (not (emacs-process-p ad-return-value))
      (setq ad-return-value nil)))
  ;;; desktop-override-stale-locks.el ends here
#+END_SRC
* Various and Sundry

** Jim Weirich's eval-buffer

   I saw Jim Weirich give a great talk at one of the keynotes of Ruby
   Conf 2012. The way he used buffer evaluation was just awesome!

   His setup (which I think is described below) allows him to
   consistently show you one piece of code and then pair that code up
   with the output that comes from executing it.

   Unlike using an inferior-ruby process, the resulting code output has
   very little noise.

   You can find the [[https://github.com/jimweirich/emacs-setup-esk/blob/master/eval-buffer.el][original code that he wrote right here]].

   The only thing I've changed is the variable
   =jw-eval-buffer-commands= and instead I've created
   =jedcn-eval-buffer-commands= just because I do not have xruby.

#+begin_src emacs-lisp
  (defconst jedcn-eval-buffer-commands
    '(("js" . "/usr/local/bin/node")
      ("rb" . "ruby")
      ("coffee" . "/usr/local/share/npm/bin/coffee")
      ("clj" . "/Users/jim/local/bin/clojure")
      ("py" . "/usr/bin/python")))
#+end_src

#+begin_src emacs-lisp
  (defconst jw-eval-buffer-name "*EVALBUFFER*")

  (defun jw-eval-buffer ()
    "Evaluate the current buffer and display the result in a buffer."
    (interactive)
    (save-buffer)
    (let* ((file-name (buffer-file-name (current-buffer)))
           (file-extension (file-name-extension file-name))
           (buffer-eval-command-pair (assoc file-extension jedcn-eval-buffer-commands)))
      (if buffer-eval-command-pair
          (let ((command (concat (cdr buffer-eval-command-pair) " " file-name)))
            (shell-command-on-region (point-min) (point-max) command jw-eval-buffer-name nil)
            (pop-to-buffer jw-eval-buffer-name)
            (other-window 1)
            (jw-eval-buffer-pretty-up-errors jw-eval-buffer-name)
            (message ".."))
        (message "Unknown buffer type"))))

  (defun jw-eval-buffer-pretty-up-errors (buffer)
    "Fix up the buffer to highlight the error message (if it contains one)."
    (save-excursion
      (set-buffer buffer)
      (goto-char (point-min))
      (let ((pos (search-forward-regexp "\\.rb:[0-9]+:\\(in.+:\\)? +" (point-max) t)))
        (if pos (progn
                  (goto-char pos)
                  (insert-string "\n\n")
                  (end-of-line)
                  (insert-string "\n"))))))

  (defun jw-clear-eval-buffer ()
    (interactive)
    (save-excursion
      (set-buffer jw-eval-buffer-name)
      (kill-region (point-min) (point-max))))

  (defun jw-eval-or-clear-buffer (n)
    (interactive "P")
    (cond ((null n) (jw-eval-buffer))
          (t (jw-clear-eval-buffer))))
#+end_src
* Appendix A: Installation Details

  This appendix covers both how I install Emacs on MacOS and how I get
  up and running with =emacs-setup=.

** Emacs Installation

   On MacOS I install Emacs using [[http://brew.sh/][Homebrew]]. I run the following,
   inspired by this [[http://emacsredux.com/blog/2013/08/21/color-themes-redux/][Emacs Redux post on color themes]]:

#+begin_src sh :tangle no
  brew install emacs --cocoa --srgb
#+end_src

   This takes some time to complete, and when finished I take another
   step to make Emacs appear as one of my Applications:

#+begin_src sh :tangle no
  ln -s /usr/local/Cellar/emacs/24.3/Emacs.app /Applications
#+end_src

   Now I can start emacs by selecting it graphically in the
   Applications area.

** Using =emacs-setup=

   Once I have Emacs 24+ running, I use git to clone my =emacs-setup=
   to my machine, cd into the cloned directory, and source the file
   =install.sh=:

#+begin_src shell-script :tangle no
  git clone https://github.com/jedcn/emacs-setup.git
  cd emacs-setup
  source install.sh
#+end_src

   The contents of the =install.sh= file achieve the following:

   + They allow you to supply a =HOME= and will create an =.emacs.d=
     if needed.

   + They create a link within this =.emacs.d= back to the cloned
     =emacs-setup=.

   + They create a single line of elisp that loads up the composite
     =emacs-setup.el=.

#+begin_src sh :tangle install.sh
  emacs_setup_dir=`pwd`

  echo "Creating $HOME/.emacs.d (if needed)"
  mkdir -p $HOME/.emacs.d

  echo "Creating $HOME/.emacs.d/emacs-setup as link to $emacs_setup_dir"
  ln -s $emacs_setup_dir $HOME/.emacs.d/emacs-setup

  echo "Creating $HOME/.emacs.d/init.el"
  echo '(load (concat user-emacs-directory "emacs-setup/emacs-setup.el"))' >> $HOME/.emacs.d/init.el
#+end_src

   It is important to note that =HOME= can be given a temporary value
   and this lets me test my installation process. I can get a fresh
   copy of =emacs-setup= and clone it into a temporary directory, and
   then I can run the =install.sh= with a temporary value of =HOME=
   like so:

#+begin_src sh :tangle no
  mkdir /tmp/emacs-setup && cd /tmp/emacs-setup
  git clone https://github.com/jedcn/emacs-setup.git .

  mkdir /tmp/emacs-home
  HOME=/tmp/emacs-home source install.sh
  HOME=/tmp/emacs-home /Applications/Emacs.app/Contents/MacOS/Emacs &
#+end_src
* Appendix B: Babel and the Config

  My configuration is stored as several .org files. This is done to
  optimize for editing and the production of documentation (via
  =org-export=). However, emacs does not read these .org files and
  instead it reads a single elisp file, =emacs-setup.el=.

  How is a single elisp file generated from several .org files? The
  .org files are concatenated together in a specific order to create a
  composite .org file named =emacs-setup.org=. This composite file can
  be used to generate =emacs-setup.el=, and it can also generate
  complete documentation in various formats: HTML or LaTeX/PDF.

  Emacs has built in support for extracting and loading elisp within
  .org files via =org-babel-load-file=. Why not just use this on each
  .org file individually rather than orchestrating a process by which
  they are concatenated into a single, larger document? I want to
  focus on woven documentation. Why not just operate on just a larger
  .org file? I want to work towards modularity. Putting these two
  concepts together, I think of each .org file as a stand-alone entity
  that is both chapter in a larger story and section in a larger
  program.

  The remainder of this appendix details how this orchestration
  works. All of the functions and variables in this section begin with
  =jedcn-es/= to indicate their logical association with my (=jedcn=)
  emacs setup (=es=).

** Composite File

   The name of the composite .org file is =emacs-setup.org=, and its
   location is stored for future reference in =composite-org=.

#+begin_src emacs-lisp
  (setq jedcn-es/composite-org (concat
                                jedcn-es/dir
                                "/emacs-setup.org"))
#+end_src

** Component Files

   The list of files that will be included in the is stored in
   =files=. Order is significant. These files are presumed to be
   within =files-dir=.

#+begin_src emacs-lisp
  (setq jedcn-es/files-dir (concat
                            jedcn-es/dir
                            "/org"))

  (setq jedcn-es/files '("introduction.org"
                         "general-setup.org"
                         "personal-information.org"
                         "key-bindings.org"
                         "behaviors.org"
                         "modes.org"
                         "various-and-sundry.org"
                         "appendix-a.org"
                         "appendix-b.org"))
#+end_src

** Concatenation

   The composite file is created with =create-composite-org=, which in
   turn relies on =concat-files=, =files-dir=, and =files=, and
   =composite-org=.

#+begin_src emacs-lisp
  (defun jedcn-es/concat-files (the-files target-file)
    "Concatenate a list of THE-FILES into a TARGET-FILE"
    (let* ((original-buffer (current-buffer))
           (result-file target-file)
           (files the-files)
           (file (car files)))
      ;; do..
      (find-file file)
      (write-region (point-min) (point-max) result-file)
      (setq files (cdr files))
      (setq file (car files))
      ;; while
      (while files
        (find-file file)
        (write-region (point-min) (point-max) result-file t)
        (setq files (cdr files))
        (setq file (car files)))
      (switch-to-buffer original-buffer)))

  (defun jedcn-es/create-composite-org ()
    "Create a composite org file based on my list of config files"
    (jedcn-es/concat-files
     (mapcar (lambda (file)
               (concat jedcn-es/files-dir "/" file))
             jedcn-es/files)
     jedcn-es/composite-org))
#+end_src

