emacs-setup.org
** Extracting elisp

   Literate programming uses the verb "tangling" to describe the
   extraction of pure source code from its annotated source. We'll aim
   to extract the elisp from =composite-org= and place it into
   =composite-el=.

#+begin_src emacs-lisp
  (setq jedcn-es/composite-el (concat jedcn-es/dir "/emacs-setup.el"))
#+end_src

   Babel supports code extraction with a function named
   =org-babel-tangle-file=, and we can hook into the process described
   above as follows:

#+begin_src emacs-lisp
  (defun jedcn-es/tangle-composite-org ()
    (org-babel-tangle-file jedcn-es/composite-org jedcn-es/composite-el))
#+end_src

   When this has completed, we will have the tangled result residing
   at =composite-el=. The next logical step is to load it up and try
   it out:

#+begin_src emacs-lisp
  (defun jedcn-es/load-composite-el ()
    (load-file jedcn-es/composite-el))
#+end_src

   Stepping back, we can bundle up the creation of the composite .org
   file from its component pieces, then tangle it, and then load the
   result with =jedcn-es/rebuild-and-reload=:

#+begin_src emacs-lisp
  (defun jedcn-es/rebuild-and-reload ()
    "Rebuild the composite .org file, extract the elisp, and reload"
    (interactive)
    (jedcn-es/create-composite-org)
    (jedcn-es/tangle-composite-org)
    (jedcn-es/load-composite-el))
#+end_src

   This is the only function I make interactive. In practice, this
   means that I can fool around with my .org files, and then =M-x
   jedcn-es/rebuild-and-reload= to try out the latest changes.
