emacs-setup.el

(setq jedcn-es/composite-el (concat jedcn-es/dir "/emacs-setup.el"))

(defun jedcn-es/tangle-composite-org ()
  (org-babel-tangle-file jedcn-es/composite-org jedcn-es/composite-el))

(defun jedcn-es/load-composite-el ()
  (load-file jedcn-es/composite-el))

(defun jedcn-es/rebuild-and-reload ()
  "Rebuild the composite .org file, extract the elisp, and reload"
  (interactive)
  (jedcn-es/create-composite-org)
  (jedcn-es/tangle-composite-org)
  (jedcn-es/load-composite-el))
